Jesstr8803/MA-ESPortable/firmware/sdkconfig.defaults
# MA-ESPortable — default sdkconfig
# Carries forward the predecessor's hard-won settings, ADAPTED for a battery device.

# --- Target / flash / PSRAM (ESP32-S3R8: 16MB flash, 8MB octal PSRAM) ---
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y

# --- Partition table (custom dual-OTA, see partitions.csv) ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- CPU ---
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# --- WiFi / lwIP tuning (predecessor: big TCP windows cured audio stutter) ---
# NOTE: predecessor ran WIFI_PS_NONE + max TX power (mains device). This is a
# BATTERY device + SOLO listener, so power-save is enabled at runtime and the
# deep audio buffer covers the jitter. Buffers stay large for glitch-free play.
CONFIG_LWIP_TCP_WND_DEFAULT=65535
CONFIG_LWIP_TCP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=64
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y

# --- FreeRTOS ---
CONFIG_FREERTOS_HZ=1000

# --- LVGL display config (must match the panel) ---
# RGB565, and BYTE-SWAPPED — the SH8601 QSPI panel needs the 16-bit color bytes
# swapped (Waveshare's working demo sets this; without it the screen is black).
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_COLOR_16_SWAP=y

# --- Task watchdog: don't watch the idle tasks ---
# The LVGL render task is busy enough that the IDLE task on its core can be
# starved briefly during full-screen flushes; that's expected for a GUI device
# (the Waveshare reference config does the same). Keep the WDT enabled for real
# hangs, but don't trip on idle starvation.
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n

# --- USB (USB-Serial-JTAG console; native USB free for future USB-DAC mode) ---
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# --- Logging ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
